sources/tube/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.001;
//scale 5;

// Геометрия
 R 2.0;       // Радиус пробирки
 Rb 1;        // Радиус закругления дна
 L 7.0;        // Высота пробирки без учета дна
 Lh 2;        // Высота охлаждающего эемента
// Beta  10;    // Угол наклона мениска
// Alpha 30;    // Угол наклона пробирки
 M 50;        // Радиус закругления мениска

// Параметры сетки
// nM   7;       // Разбиение блоков по радиусу
// nL   50;      // Основная высота пробики
// nH   10;      // Высота в области нагрева
nM 1; nL 1; nH 1;

// Коэффициенты неравномерности сетки
 DnL   1.5;
// DnSM1 ((0.25 0.25 1) (0.75 0.75 1));

//=======================================

 a1 0.5;
 a2 1.15;

#include "mathematics.bmd"
#include "tmpVars.bmd"

#include "coordinates.bmd"
#include "blocks.bmd"
#include "edges.bmd"

//#include "boundaries.bmd"
boundary
(


    walls
    {
        type wall;
        faces
        (
            (0 16 15 14)
            (0 18 17 16)

            (14 15 35 34)
            (15 16 36 35)
            (16 17 37 36)
            (17 18 38 37)

            (32 33 53 52)
            (33 34 54 53)
            (34 35 55 54)
            (35 36 56 55)
            (36 37 57 56)
            (37 38 58 57)
            (38 39 59 58)
            (39 32 52 59)

            (52 53 73 72)
            (53 54 74 73)
            (54 55 75 74)
            (57 58 78 77)
            (58 59 79 78)
            (59 52 72 79)

            (61 62 63 64)
            (61 64 65 66)
            (61 66 67 68)
            (61 68 69 62)

            (62 72 73 63)
            (63 73 74 64)
            (64 74 75 65)
            (65 75 76 66)
            (66 76 77 67)
            (67 77 78 68)
            (68 78 79 69)
            (69 79 72 62)
        );
    }
);

mergePatchPairs (
);

//#calc "printf(\"\n\n\n\n\n====> 182 (%f,%f)\n====> 183 (%f,%f)\n====> 178 (%f,%f)\n====> 179 (%f,%f)\n====> Pc (%f,%f)\n-----> K = %f \t K^2 = %f\n-----> B = %f\n-----> h = %f\n-----> sin(omg) = %f \t cos(omg) = %f\n\n\n\n\n\",$y232,$z232,$y233,$z233,$y228,$z228,$y229,$z229,$tmpYsm,$tmpZsm,$tmpKsm,$tmpAsm,$tmpBsm,$tmpHsm,$SinAomg,$CosAomg)";

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++






