sources/tube/system/mathematics.bmd
Pi     #calc "asin(1.0) * 2.0";
sin45  #calc "sin($Pi / 4.0)";
sin225 #calc "sin($Pi / 8.0)";
sin675 #calc "sin($Pi * 3.0 / 8.0)";
